// 帖子详情 来自抗压背锅吧 https://tieba.baidu.com/p/8267375890?pid=146880027549&cid=#146880027549

import type { PostInfo } from "./type";

export const useService = (): PostInfo => {
  return {
    title: "前线急报！飞将相布出任高丽中军大将，目前已于阵前挑战！",
    author: "姬野 Kiye",
    comment: [
      {
        id: 1,
        username: "姬野 Kiye",
        content: "今兮将军已不在，震旦哪位将军能拿下此人？",
        datetime: "2023-02-16 22:36",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "1楼",
        cover: "./assets/faker.jpeg",
        reply: [],
      },
      {
        id: 2,
        username: "olxbjzdfg",
        content:
          "lpl帐下第一大将军胎虎将军是飞一儿，现已弃暗投明lpl多年，若以父子之情说之，动之以情晓之以理，定能使大飞以礼来降",
        datetime: "2023-02-16 22:42",
        device: "Android客户端", // 来自
        ipAddress: "河南", // ip属地
        floor: "2楼",
        cover: "",
        reply: [
          {
            id: 1,
            username: "卓定亲爹李元浩",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "希垃和小虎一样都是只赢过大飞一个bo5，不知道为啥希垃成了大飞的爹而小虎成大飞的儿，希垃赢得还是18年春四夏六世界赛都没进谁都能踩一脚的大飞(那年小虎洲际赛也赢大飞了)，小虎msi赢得是22春十八连胜一场没输的大飞",
            datetime: "2023-2-16 23:47",
          },
          {
            id: 2,
            username: "卓定亲爹李元浩",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "希垃这种逮住大飞最垃的时候赢一把，然后就缩家里看比赛保住打飞胜率，小虎s赛输的多是因为他有资格和大飞打，希垃17msi被阿p送走见不到大飞，17s赛被皇冠送走见不到大飞，然后年年季后赛都打不明白连外战的资格都没有，最后孝子狂吹希垃的大飞胜率",
            datetime: "2023-2-16 23:52",
          },
          {
            id: 3,
            username: "小小小老师",
            replyId: 2,
            replyUsername: "卓定亲爹李元浩",
            postId: 2,
            content: "打大飞这种还得左手给他上强度 小虎这种混子不行的",
            datetime: "2023-2-17 00:31",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 3,
        username: "逻辑学家",
        content: "我方上将，晴天大将军申请出战",
        datetime: "2023-02-16 22:42",
        device: "Android客户端", // 来自
        ipAddress: "云南", // ip属地
        floor: "3楼",
        cover: "",
        reply: [
          {
            id: 1,
            username: "🌏社会学加3",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "无名小卒，不足挂齿",
            datetime: "2023-2-16 22:44",
          },
          {
            id: 2,
            username: "球场至尊蔡徐",
            replyId: 1,
            replyUsername: "🌏社会学加3",
            postId: 2,
            content: "且待晴天温酒可斩",
            datetime: "2023-2-16 23:54",
          },
          {
            id: 3,
            username: "不要欺负**了",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "且给晴天大将军备好佳人文波，待其凯旋以享",
            datetime: "2023-2-17 03:32",
          },
          {
            id: 4,
            username: "寄寄子OvO",
            replyId: 3,
            replyUsername: "不要欺负了",
            postId: 2,
            content: "逆天",
            datetime: "2023-2-17 07:37",
          },
          {
            id: 5,
            username: "lzgiveup",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "火速招我方南韩降将zeka大将军，率kingen，deft，原神等一众偏将与持刀童子p小将！三更夜率军突袭t1本部，则定取大飞押解于lpl",
            datetime: "2023-2-17 08:16",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 4,
        username: "姬野 Kiye",
        content: "豫州上将军虎将元昊！战功赫赫！可与之一战乎？",
        datetime: "2023-02-16 22:43",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "4楼",
        cover: "./assets/xiaohu.jpeg",
        reply: [
          {
            id: 1,
            username: "逻辑学家",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "小战勇猛，大战拉跨，不如晴天大将军",
            datetime: "2023-2-16 22:44",
          },
          {
            id: 2,
            username: "虐悟空de八戒",
            replyId: 0,
            replyUsername: "",
            postId: 4,
            content: "飞生万物以养虎，虎无一物以报飞",
            datetime: "2023-2-16 22:50",
          },
          {
            id: 3,
            username: "我乃道长",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "春日尚可一战，然夏秋若至，旧疾复发，当不得领军大将也。",
            datetime: "2023-2-16 23:09",
          },
          {
            id: 4,
            username: "群星闪耀时°",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "境内一流，然每与半岛李氏相赫相争，如临天敌，胜者罕见；饱受屈辱，为众人嬉。以我观之，不堪一用。",
            datetime: "2023-2-16 23:24",
          },
          {
            id: 5,
            username: "左手滚出京东",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "报！虎将军竟是飞大将亲子，飞虎二人于两军阵前父子相认，子逆父命乃是不孝，不能担此大任矣！",
            datetime: "2023-2-17 00:54",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 4,
        username: "姬野 Kiye",
        content:
          "江右卓将军！少年天才，曾于飞将交战，一胜一负，未落下风！然生性过于小心谨慎，唯恐贻误战机！",
        datetime: "2023-02-16 22:52",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "9楼",
        cover: "./assets/zuoshou.jpeg",
        reply: [
          {
            id: 1,
            username: "Nifiv",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "懦手色厉而胆薄，非大飞敌手",
            datetime: "2023-2-16 22:59",
          },
          {
            id: 2,
            username: "一颗水蜜桃",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "卓将军生性优柔寡断，不可与飞将军一战",
            datetime: "2023-2-16 23:03",
          },
          {
            id: 3,
            username: "逻辑学家",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "今飞将今非昔比，又有大奖寿司相助。大敌当前，恐自乱阵脚。若飞将以武吓之，亦可未战先降，不可重用也。",
            datetime: "2023-2-16 23:34",
          },
          {
            id: 4,
            username: "群星闪耀时°",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "虚负盛名，绩如其表，卑下媚上，凌弱畏强。 只可对二流，不可战强敌",
            datetime: "2023-2-16 23:44",
          },
          {
            id: 5,
            username: "圣母表孜独角兰",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "这个行军途中被越南土匪俘虏了",
            datetime: "2023-2-17 03:46",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 5,
        username: "姬野 Kiye",
        content:
          "邕州豪杰安将军！虽内战平平，然外战出色！曾于世界大战憾负高丽秀将军，其可效仿兮将军而拒飞将耶？",
        datetime: "2023-02-16 23:03",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "21楼",
        cover: "./assets/angle.jpeg",
        reply: [
          {
            id: 1,
            username: "楼上去sham",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "善，然安将军，以深中僵毒，不知可还提的动刀",
            datetime: "2023-2-17 09:16",
          },
          {
            id: 2,
            username: "原来是只呆雁",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "安将军壮年时尚且不如敌军小将秀妹，如今已垂垂老矣，恐不如飞将多矣",
            datetime: "2023-2-17 09:18",
          },
          {
            id: 3,
            username: "Dime",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "向涛老矣，尚能饭否？",
            datetime: "2023-2-17 09:43",
          },
          {
            id: 4,
            username: "了狗了",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "不可，安将军尸毒已深，另遣良将迎敌，待奥妃为安将军吸出尸毒方可一战",
            datetime: "2023-2-17 10:01",
          },
          {
            id: 5,
            username: "铁胆火车侠😇",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "此前在微博帐中，遭僵毒侵害，现已回天乏术",
            datetime: "2023-2-17 11:41",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 5,
        username: "姬野 Kiye",
        content:
          "巨斧余大将军！虽为后起之秀，且不晓中军事务。然其与飞将积怨已久，或可使其为奇策，打飞将一措手不及！",
        datetime: "2023-02-16 23:15",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "26楼",
        cover: "./assets/qingtian.jpeg",
        reply: [
          {
            id: 1,
            username: "逻辑学家",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "晴天大将军，虽不及简大将军，然勇猛过人，若以晴天大将军为我军先锋，使鸟将军辅佐之，定能击退来犯之敌！",
            datetime: "2023-2-16 23:24",
          },
          {
            id: 2,
            username: "关于乌龟的惰",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "这厮力压同门黄狗将军，但有勇无谋怕是难堪重任，若让此将面对飞将的左膀右臂怕会败走麦城",
            datetime: "2023-2-16 23:49",
          },
          {
            id: 3,
            username: "左手滚出京东",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "飞将老谋深算，晴天虽后起之秀，然经验不足，英勇有余，谋略不足，恐成关羽前车啊！",
            datetime: "2023-2-17 01:00",
          },
          {
            id: 4,
            username: "爱作诗的章总",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "勇力过人，然智略不足，恐被擒矣",
            datetime: "2023-2-17 08:22",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
      {
        id: 6,
        username: "姬野 Kiye",
        content:
          "高丽名将金将军！高丽人氏，然目前已于震旦安家立业。曾夺得桂冠，现虽赋闲在家，但心系庙堂之事，于讲武堂挥斥方遒，指点江山，听者甚众。此人重利，若出千金，连夜改籍，未必不可为吾等所用。另若决议用此人，军中斥候切记莫用玉将军！",
        datetime: "2023-02-16 23:29",
        device: "Android客户端", // 来自
        ipAddress: "广东", // ip属地
        floor: "32楼",
        cover: "./assets/doinb.jpeg",
        reply: [
          {
            id: 1,
            username: "左手滚出京东",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "对己国不忠之人焉能忠他人之国？若敌以利诱之，必使其临阵倒戈，不可用也！",
            datetime: "2023-2-17 01:04",
          },
          {
            id: 2,
            username: "富士山下呐",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "此人摇唇鼓舌尚可，当不得大任",
            datetime: "2023-2-17 06:53",
          },
          {
            id: 3,
            username: "七草荠在安菲尔德",
            replyId: 0,
            replyUsername: "originol",
            postId: 2,
            content:
              "金玉二将素来不和，二人见面如丧考批恐难当此任，想我大LPL竟无一人可用，呜呼，危矣！",
            datetime: "2023-2-17 09:08",
          },
          {
            id: 4,
            username: "超级ih9",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content:
              "拉夫虽心向我军，但与那玉玉打野素有间隙，恐因二人不合致使军中骨灰大乱，万马皆喑，非上策也",
            datetime: "2023-2-17 09:34",
          },
          {
            id: 5,
            username: "玛瑟里顿",
            replyId: 0,
            replyUsername: "linhuaixinl",
            postId: 2,
            content:
              "且其为人放浪形骸，所历之处多有间隙，吾观之其人只知名利不知忠义，性聪敏但但贪图小利，非大将之才",
            datetime: "2023-2-17 10:49",
          },
          {
            id: 1,
            username: "",
            replyId: 0,
            replyUsername: "",
            postId: 2,
            content: "",
            datetime: "",
          },
        ],
      },
    ],
  };
};
